---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PlumbingFixturesHwConnection
source: html/ab9b76e5-005d-d122-e4f2-64c7ffc8dd93.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PlumbingFixturesHwConnection Property

"HW Connection"

## Syntax (C#)
```csharp
public static ForgeTypeId PlumbingFixturesHwConnection { get; }
```